In [62]:
import pandas as pd
import numpy as np
file=pd.read_csv("chat.csv")
print(file)

#col = ["Job","Gender"]
#file.drop(columns=col, inplace=True, axis=1)
#print(file)

     Age  Gender       Job Education Martial Status  \
0  20-25    Male  Student      BS CS         Single
1  20-25  Female  Student     BS Bio         Single
2  30-40    Male       NaN        BS       Married
3  25-30    Male  Student         BS         Single

                                             Messege
0  Elaka,zama da kar  d sa okra,aw kna,bas preda ...
1  Aoa bhai,Bhai pesi send kol de taso ba send ka...
2  Saylani Mass IT Training Program Peshawar,Get ...
3  Kindly ensure you bring the following items,Ad...

In [63]:
file.head(5)

,Age,Gender,Job,Education,Martial Status,Messege
0,20-25,Male,Student,BS CS,Single,"Elaka,zama da kar d sa okra,aw kna,bas preda ..."
1,20-25,Female,Student,BS Bio,Single,"Aoa bhai,Bhai pesi send kol de taso ba send ka..."
2,30-40,Male,NaN,BS,Married,"Saylani Mass IT Training Program Peshawar,Get ..."
3,25-30,Male,Student,BS,Single,"Kindly ensure you bring the following items,Ad..."

In [64]:
file.tail()

,Age,Gender,Job,Education,Martial Status,Messege
0,20-25,Male,Student,BS CS,Single,"Elaka,zama da kar d sa okra,aw kna,bas preda ..."
1,20-25,Female,Student,BS Bio,Single,"Aoa bhai,Bhai pesi send kol de taso ba send ka..."
2,30-40,Male,NaN,BS,Married,"Saylani Mass IT Training Program Peshawar,Get ..."
3,25-30,Male,Student,BS,Single,"Kindly ensure you bring the following items,Ad..."

In [65]:
file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             4 non-null      object
 1   Gender          4 non-null      object
 2   Job             3 non-null      object
 3   Education       4 non-null      object
 4   Martial Status  4 non-null      object
 5   Messege         4 non-null      object
dtypes: object(6)
memory usage: 324.0+ bytes

In [66]:
file.describe()

,Age,Gender,Job,Education,Martial Status,Messege
count,4,4,3,4,4,4
unique,3,2,1,3,2,4
top,20-25,Male,Student,BS,Single,"Elaka,zama da kar d sa okra,aw kna,bas preda ..."
freq,2,3,3,2,3,1

In [67]:

#col = ["Job"]
#file.drop(columns=col, inplace=True, axis=1)
#print(file)


#file.drop(colums=to_drop, inplace=true)

In [68]:
file["Job"].isnull()

0    False
1    False
2     True
3    False
Name: Job, dtype: bool

In [73]:
file["Job"].head(10)

0    Student
1    Student
2         NaN
3    Student
Name: Job, dtype: object

In [74]:
file["Job"].fillna("Computer", inplace= True)
print(file)

     Age  Gender       Job Education Martial Status  \
0  20-25    Male  Student      BS CS         Single
1  20-25  Female  Student     BS Bio         Single
2  30-40    Male  Computer        BS       Married
3  25-30    Male  Student         BS         Single

                                             Messege
0  Elaka,zama da kar  d sa okra,aw kna,bas preda ...
1  Aoa bhai,Bhai pesi send kol de taso ba send ka...
2  Saylani Mass IT Training Program Peshawar,Get ...
3  Kindly ensure you bring the following items,Ad...